import { makeShot } from "../logic/makeShot";

let field1, users1;
let field2, users2;
let field3, users3;
let field4, users4;
let field5, users5;
let field6, users6;
let field7, users7;
let field8, users8;
let field9, users9;
let field10, users10;
let field11, users11;
let field12, users12;

beforeEach(() => {
  field1 = [
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", "*", " ", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    ["*", " ", "*", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users1 = [{ id: 0, name: "tester", row: 2, col: 1, direction: "UP" }];

  field2 = [
    ["*", " ", "*", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    [" ", "*", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users2 = [{ id: 0, name: "tester", row: 1, col: 1, direction: "BOTTOM" }];

  field3 = [
    ["*", "*", " ", " ", " ", " ", " "],
    [" ", "*", "*", " ", " ", " ", " "],
    ["*", "*", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users3 = [{ id: 0, name: "tester", row: 1, col: 1, direction: "RIGHT" }];

  field4 = [
    [" ", " ", "*", "*", " ", " ", " "],
    [" ", "*", "*", " ", " ", " ", " "],
    [" ", " ", "*", "*", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users4 = [{ id: 0, name: "tester", row: 1, col: 2, direction: "LEFT" }];

  field5 = [
    [" ", "*", "*", " ", " ", " ", " "],
    ["*", "*", " ", " ", " ", " ", " "],
    [" ", "*", "*", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users5 = [{ id: 0, name: "tester", row: 1, col: 1, direction: "LEFT" }];

  field6 = [
    [" ", "*", " ", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    ["*", " ", "*", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users6 = [{ id: 0, name: "tester", row: 1, col: 1, direction: "UP" }];

  field7 = [
    [" ", " ", " ", " ", "*", "*", " "],
    [" ", " ", " ", " ", " ", "*", "*"],
    [" ", " ", " ", " ", "*", "*", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users7 = [{ id: 0, name: "tester", row: 1, col: 5, direction: "RIGHT" }];

  field8 = [
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    ["*", " ", "*", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    [" ", "*", " ", " ", " ", " ", " "],
  ];

  users8 = [{ id: 0, name: "tester", row: 3, col: 1, direction: "BOTTOM" }];

  field9 = [
    ["*", " ", "*", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    [" ", "*", " ", " ", " ", " ", " "],
    [" ", "*", " ", " ", " ", " ", " "],
    ["*", "*", "*", " ", " ", " ", " "],
    ["*", " ", "*", " ", " ", " ", " "],
  ];

  users9 = [
    {
      id: 0,
      name: "tester1",
      row: 1,
      col: 1,
      direction: "BOTTOM",
      coordinates: [
        [0, 0],
        [0, 2],
        [1, 0],
        [1, 1],
        [1, 2],
        [2, 1],
      ],
    },
    {
      id: 1,
      name: "tester2",
      row: 4,
      col: 1,
      direction: "UP",
      coordinates: [],
    },
  ];

  field10 = [
    ["*", "*", " ", " ", "*", " ", " "],
    [" ", "*", "*", "*", "*", "*", " "],
    ["*", "*", " ", "*", " ", "*", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
  ];

  users10 = [
    {
      id: 0,
      name: "tester1",
      row: 1,
      col: 1,
      direction: "RIGHT",
      coordinates: [
        [0, 0],
        [0, 1],
        [1, 1],
        [1, 2],
        [2, 0],
        [2, 1],
      ],
    },
    {
      id: 1,
      name: "tester2",
      row: 1,
      col: 4,
      direction: "UP",
      coordinates: [
        [0, 4],
        [1, 3],
        [1, 4],
        [1, 5],
        [2, 3],
        [2, 5],
      ],
    },
  ];

  field11 = [
    [" ", " ", "*", " ", "*", " ", " "],
    [" ", " ", "*", "*", "*", " ", " "],
    [" ", " ", " ", "*", " ", " ", " "],
    [" ", " ", " ", "*", "*", " ", " "],
    [" ", " ", "*", "*", " ", " ", " "],
    [" ", " ", " ", "*", "*", " ", " "],
  ];

  users11 = [
    {
      id: 0,
      name: "tester1",
      row: 1,
      col: 3,
      direction: "BOTTOM",
      coordinates: [],
    },
    {
      id: 1,
      name: "tester2",
      row: 4,
      col: 3,
      direction: "LEFT",
      coordinates: [
        [3, 3],
        [3, 4],
        [4, 2],
        [4, 3],
        [5, 3],
        [5, 4],
      ],
    },
  ];

  field12 = [
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", " ", " ", " ", " ", " ", " "],
    [" ", "*", " ", "*", " ", "*", "*"],
    [" ", "*", "*", "*", "*", "*", " "],
    [" ", " ", "*", " ", " ", "*", "*"],
  ];

  users12 = [
    {
      id: 0,
      name: "tester1",
      row: 4,
      col: 2,
      direction: "BOTTOM",
      coordinates: [
        [3, 1],
        [3, 3],
        [4, 1],
        [4, 2],
        [4, 3],
        [5, 2],
      ],
    },
    {
      id: 1,
      name: "tester2",
      row: 3,
      col: 5,
      direction: "LEFT",
      coordinates: [],
    },
  ];
});

it("makeShot: выстрел вверх", () => {
  expect(makeShot(field1, users1, 0, [])).toEqual([
    [
      [" ", "⚫", " ", " ", " ", " ", " "],
      [" ", "*", " ", " ", " ", " ", " "],
      ["*", "*", "*", " ", " ", " ", " "],
      ["*", " ", "*", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [{ userId: 0, row: 0, col: 1, direction: "UP" }],
    users1,
  ]);
});

it("makeShot: выстрел вниз", () => {
  expect(makeShot(field2, users2, 0, [])).toEqual([
    [
      ["*", " ", "*", " ", " ", " ", " "],
      ["*", "*", "*", " ", " ", " ", " "],
      [" ", "*", " ", " ", " ", " ", " "],
      [" ", "⚫", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [{ userId: 0, row: 3, col: 1, direction: "BOTTOM" }],
    users2,
  ]);
});

it("makeShot: выстрел вправо", () => {
  expect(makeShot(field3, users3, 0, [])).toEqual([
    [
      ["*", "*", " ", " ", " ", " ", " "],
      [" ", "*", "*", "⚫", " ", " ", " "],
      ["*", "*", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [{ userId: 0, row: 1, col: 3, direction: "RIGHT" }],
    users3,
  ]);
});

it("makeShot: выстрел влево", () => {
  expect(makeShot(field4, users4, 0, [])).toEqual([
    [
      [" ", " ", "*", "*", " ", " ", " "],
      ["⚫", "*", "*", " ", " ", " ", " "],
      [" ", " ", "*", "*", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [{ userId: 0, row: 1, col: 0, direction: "LEFT" }],
    users4,
  ]);
});

it("makeShot: выстрел в стену влево", () => {
  expect(makeShot(field5, users5, 0, [])).toEqual([field5, [], users5]);
});

it("makeShot: выстрел в стену вверх", () => {
  expect(makeShot(field6, users6, 0, [])).toEqual([field6, [], users6]);
});

it("makeShot: высрел в стену вправо", () => {
  expect(makeShot(field7, users7, 0, [])).toEqual([field7, [], users7]);
});

it("makeShot: высрел в стену вниз", () => {
  expect(makeShot(field8, users8, 0, [])).toEqual([field8, [], users8]);
});

it("makeShot: высрел в упор в танк сверху", () => {
  expect(makeShot(field9, users9, 1, [])).toEqual([
    [
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", "*", " ", " ", " ", " ", " "],
      ["*", "*", "*", " ", " ", " ", " "],
      ["*", " ", "*", " ", " ", " ", " "],
    ],
    [],
    users9.filter((it) => it.id !== 0),
  ]);
});

it("makeShot: высрел в упор в танк справа", () => {
  expect(makeShot(field10, users10, 0, [])).toEqual([
    [
      ["*", "*", " ", " ", " ", " ", " "],
      [" ", "*", "*", " ", " ", " ", " "],
      ["*", "*", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [],
    users10.filter((it) => it.id !== 1),
  ]);
});

it("makeShot: высрел в упор в танк снизу", () => {
  expect(makeShot(field11, users11, 0, [])).toEqual([
    [
      [" ", " ", "*", " ", "*", " ", " "],
      [" ", " ", "*", "*", "*", " ", " "],
      [" ", " ", " ", "*", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
    ],
    [],
    users11.filter((it) => it.id !== 1),
  ]);
});

it("makeShot: высрел в упор в танк слева", () => {
  expect(makeShot(field12, users12, 1, [])).toEqual([
    [
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", " ", " "],
      [" ", " ", " ", " ", " ", "*", "*"],
      [" ", " ", " ", " ", "*", "*", " "],
      [" ", " ", " ", " ", " ", "*", "*"],
    ],
    [],
    users12.filter((it) => it.id !== 0),
  ]);
});

// выстрел в упор в другой снаряд
