import { placeTankOnField } from "./../logic/placeTankOnField";

const emptyField = [
  [" ", " ", " ", " ", " "],
  [" ", " ", " ", " ", " "],
  [" ", " ", " ", " ", " "],
  [" ", " ", " ", " ", " "],
  [" ", " ", " ", " ", " "],
];

const fieldWithTank = [
  [" ", "*", " ", " ", " "],
  ["*", "*", "*", " ", " "],
  ["*", " ", "*", " ", " "],
  [" ", " ", " ", " ", " "],
  [" ", " ", " ", " ", " "],
];

// it("placeTankOnField: Верхний левый угол", () => {
//   expect(placeTankOnField(emptyField, 1, 1)).toEqual([
//     [" ", "*", " ", " ", " "],
//     ["*", "*", "*", " ", " "],
//     ["*", " ", "*", " ", " "],
//     [" ", " ", " ", " ", " "],
//     [" ", " ", " ", " ", " "],
//   ]);
// });
//
// it("placeTankOnField: По центру", () => {
//   expect(placeTankOnField(emptyField, 2, 2)).toEqual([
//     [" ", " ", " ", " ", " "],
//     [" ", " ", "*", " ", " "],
//     [" ", "*", "*", "*", " "],
//     [" ", "*", " ", "*", " "],
//     [" ", " ", " ", " ", " "],
//   ]);
// });
//
// it("placeTankOnField: По центру, ствол влево", () => {
//   expect(placeTankOnField(emptyField, 2, 2)).toEqual([
//     [" ", " ", " ", " ", " "],
//     [" ", " ", "*", "*", " "],
//     [" ", "*", "*", " ", " "],
//     [" ", " ", "*", "*", " "],
//     [" ", " ", " ", " ", " "],
//   ]);
// });
//
// it("placeTankOnField: По центру, ствол вправо", () => {
//   expect(placeTankOnField(emptyField, 2, 2)).toEqual([
//     [" ", " ", " ", " ", " "],
//     [" ", "*", "*", " ", " "],
//     [" ", " ", "*", "*", " "],
//     [" ", "*", "*", " ", " "],
//     [" ", " ", " ", " ", " "],
//   ]);
// });
//
// it("placeTankOnField: По центру, ствол вниз", () => {
//   expect(placeTankOnField(emptyField, 2, 2)).toEqual([
//     [" ", " ", " ", " ", " "],
//     [" ", "*", " ", "*", " "],
//     [" ", "*", "*", "*", " "],
//     [" ", " ", "*", " ", " "],
//     [" ", " ", " ", " ", " "],
//   ]);
// });

it("placeTankOnField: Попытка разместить поверх другого танка", () => {
  expect(placeTankOnField(fieldWithTank, 1, 1)).toThrow(TypeError);
});
